# 基本数据类型

counter = 100  # 整形变量
miles = 1000.0  # 浮点型变量
name = 'runoob'  # 字符串

print(counter)
print(miles)
print(name)

# 同时赋值多个变量

a = b = c = 1
print(a)

print('----------------------------------------------------------------------------------------------------')
a, b, c, d = 20, 2.2, True, 4 + 3j
print(type(a), type(b), type(c), type(d))

print(isinstance(a, int))
print('----------------------------------------------------------------------------------------------------')
var1 = 1
var2 = 2

# del var1  # 删除掉引用
# print(var1) # 以被删除掉报异常

print('----------------------------------------------------------------------------------------------------')

# 加
print(4 + 5)
# 减
print(4 - 5)
# 乘
print(4 * 5)

# 除，保留小数
print(4 / 5)
# 除,不保留小数
print(4 // 5)

# 取余
print(4 % 5)

# 乘方
print(2 ** 5)  # 2的5次方



